# 데이터 전처리 실습

타이타닉 데이터셋으로 데이터 전처리를 실습해 보자.
* 결측치 처리하기
* 데이터 스케일 조정
* 범주형 데이터 처리하기

1, 타이타닉 데이터 셋을 읽어 들인다. 
```
import pandas as pd

titanic = pd.read_csv('../data/titanic.csv')
titanic.head()
```

In [1]:
import pandas as pd

titanic = pd.read_csv('../data/titanic.csv')
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

2. 'Age' 컬럼의 결측치가 총 몇 건인가?

In [2]:
titanic['Age'].isnull().sum()

177

3. 'Age'컬럼의 결측치를 중위수(median)으로 대체하시오.

In [3]:
med = titanic['Age'].median()

titanic['Age'] = titanic['Age'].fillna(med)

In [4]:
titanic['Age'].isnull().sum()

0

4. 'Fare' 컬럼을 StandardScaler()로 스케일을 조정하시오.

In [5]:
from sklearn.preprocessing import StandardScaler

titanic['Std_Fare'] = StandardScaler().fit_transform(titanic['Fare'].values.reshape(-1,1))

In [6]:
titanic[['Fare','Std_Fare']].head()

      Fare  Std_Fare
0   7.2500 -0.502445
1  71.2833  0.786845
2   7.9250 -0.488854
3  53.1000  0.420730
4   8.0500 -0.486337

5. 'Embarked' 컬럼을 원-핫 인코딩으로 변환해 보시오. (hint. pd.get_dummies)

In [7]:
titanic = pd.get_dummies(titanic, columns=['Embarked'])
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Std_Fare,Embarked_C,Embarked_Q,Embarked_S
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,-0.502445,0,0,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,0.786845,1,0,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,-0.488854,0,0,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,0.420730,0,0,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,-0.486337,0,0,1

6. titanic 데이터셋에서 `Age` 컬럼을 pd.cut()을 이용해 같은 길이의 구간을 가지는 다섯 개의 그룹을 생성하시오.

In [8]:
titanic['AgeBand'] = pd.cut(titanic['Age'], 5)

In [9]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 16 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Std_Fare     891 non-null    float64
 12  Embarked_C   891 non-null    uint8
 13  Embarked_Q   891 non-null    uint8
 14  Embarked_S   891 non-null    uint8
 15  AgeBand      891 non-null    category
dtypes: category(1), float64(3), int64(5), object(4), uint8(3)
memory usage: 87.4+ KB

7. 위에서 나눈 나이 구간별 생존율을 구하시오.(hint. groupby(['AgeBand']) )

In [10]:
# 각 나이 구간별 생존율
print(titanic[['AgeBand', 'Survived']].groupby(['AgeBand'], as_index=False).mean())

            AgeBand  Survived
0    (0.34, 16.336]  0.550000
1  (16.336, 32.252]  0.344168
2  (32.252, 48.168]  0.404255
3  (48.168, 64.084]  0.434783
4    (64.084, 80.0]  0.090909